app/views/users/show.html.erb

SELECT `reviews`.* FROM `reviews` WHERE (user_id <%= current_user.id %>)
---
        <ul class="user_page-contents">
        <% current_user.reviews.each do |review| %>