app/controllers/products_controller.rb

  def index
    @products = Product.order("id ASC").limit(20)
---
SELECT `products`.* FROM `products` ORDER BY id DESC LIMIT 20

  def show
    @products = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1

  def search
    @products = Product.where('product LIKE(?)', "%#{params[:keyword]}%").limit(20)
---
SELECT `products`.* FROM `products` WHERE (title LIKE('%<%= params[:keyword] %>%')) LIMIT 20