app/controllers/reviews_controller.rb

INSERT INTO `reviews` (`created_at`, `nickname`, `product_id`, `rate`, `review`, `updated_at`) VALUES ('2015-11-16 17:11:15', 'きょうへい', 90, 10, 'ロバート・デ・ニーロかっこ良すぎた！！！！！！！！！', '2015-11-16 17:11:15')
---
  def create
    Review.create(create_params)