app/views/products/index.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1
---
                      <span class="rating-star">
                      <% if product.reviews.present? %>